{
  "flashcards": [
    {
      "statement": "Rivemont était une ville côtière.",
      "isTrue": false,
      "explanation": "Rivemont était entourée de vastes forêts et de collines verdoyantes."
    },
    {
      "statement": "Jacques était bûcheron.",
      "isTrue": false,
      "explanation": "Jacques, le père, était forgeron."
    },
    {
      "statement": "Louise et Antoine ont trouvé le passage secret sous un pont.",
      "isTrue": false,
      "explanation": "Louise et Antoine ont trouvé le passage secret caché sous les racines d’un vieux chêne."
    },
    {
      "statement": "La grotte était illuminée par des torches.",
      "isTrue": false,
      "explanation": "La grotte était illuminée par des cristaux brillants incrustés dans les murs."
    },
    {
      "statement": "Le coffre contenait uniquement de l'or.",
      "isTrue": false,
      "explanation": "Le coffre était rempli d’objets précieux : des pièces d’or, des bijoux anciens, et des parchemins mystérieux."
    },
    {
      "statement": "Le parchemin parlait d'un royaume perdu.",
      "isTrue": true,
      "explanation": "Le parchemin parlait d’un royaume perdu, autrefois prospère, mais qui avait disparu dans les profondeurs de la forêt."
    },
    {
      "statement": "La famille Beaumont a trouvé des artefacts ordinaires dans la grotte.",
      "isTrue": false,
      "explanation": "Ensemble, ils ouvrirent d’autres coffres et découvrirent des artefacts magiques qui semblaient appartenir à une époque révolue."
    },
    {
      "statement": "La quête de la famille Beaumont dura des mois.",
      "isTrue": true,
      "explanation": "Leur voyage dura plusieurs mois."
    },
    {
      "statement": "Les habitants de Rivemont n'ont rien reçu du trésor.",
      "isTrue": false,
      "explanation": "Le trésor du royaume, autrefois caché, fut partagé avec les habitants de Rivemont, qui purent vivre dans la prospérité et l’harmonie."
    },
    {
      "statement": "L'histoire des Beaumont est devenue une légende transmise de génération en génération.",
      "isTrue": true,
      "explanation": "La légende des Beaumont devint une histoire transmise de génération en génération."
    }
  ]
}