{
  "flashcards": [
    {
      "statement": "Rivemont était une ville animée et bruyante.",
      "isTrue": false,
      "explanation": "Le texte décrit Rivemont comme une ville paisible où tout le monde se connaissait."
    },
    {
      "statement": "Les Beaumont étaient une famille riche et influente.",
      "isTrue": false,
      "explanation": "Le texte décrit les Beaumont comme une famille modeste."
    },
    {
      "statement": "Jacques Beaumont était boulanger.",
      "isTrue": false,
      "explanation": "Jacques Beaumont était forgeron."
    },
    {
      "statement": "Louise et Antoine ont trouvé un passage secret sous un vieux chêne.",
      "isTrue": true,
      "explanation": "Le texte indique que les enfants ont découvert un passage secret sous les racines d'un vieux chêne."
    },
    {
      "statement": "Le tunnel était lumineux et accueillant.",
      "isTrue": false,
      "explanation": "Le texte décrit le tunnel comme obscur et mystérieux."
    },
    {
      "statement": "La grotte était éclairée par des cristaux brillants.",
      "isTrue": true,
      "explanation": "Le texte mentionne que la grotte était illuminée par des cristaux brillants incrustés dans les murs."
    },
    {
      "statement": "Le coffre contenait uniquement des pièces d'or.",
      "isTrue": false,
      "explanation": "Le coffre contenait des pièces d'or, des bijoux anciens et des parchemins mystérieux."
    },
    {
      "statement": "Les parchemins parlaient d'un royaume perdu.",
      "isTrue": true,
      "explanation": "Jacques a reconnu des écritures parlant d'un royaume perdu, autrefois prospère."
    },
    {
      "statement": "La famille Beaumont a ignoré les messages sur le parchemin.",
      "isTrue": false,
      "explanation": "La famille Beaumont a décidé de retourner à la grotte pour en savoir plus."
    },
    {
      "statement": "Ils ont trouvé des artefacts magiques dans la grotte.",
      "isTrue": true,
      "explanation": "Le texte mentionne la découverte d'artefacts magiques appartenant à une époque révolue."
    },
    {
      "statement": "La terre a tremblé et une voix a ordonné à la famille de quitter la grotte.",
      "isTrue": false,
      "explanation": "La voix a ordonné à la famille d'accomplir la quête du roi disparu pour sauver Rivemont."
    },
    {
      "statement": "Leur quête les a conduits à la rencontre de créatures fantastiques.",
      "isTrue": true,
      "explanation": "Le texte mentionne la rencontre de créatures fantastiques lors de leur aventure."
    },
    {
      "statement": "Le roi était prisonnier dans une maison abandonnée.",
      "isTrue": false,
      "explanation": "Le roi était prisonnier dans une forteresse oubliée."
    },
    {
      "statement": "La libération du roi a apporté la paix à la région.",
      "isTrue": true,
      "explanation": "La libération du roi a rétabli la paix dans la région et permis aux habitants de vivre dans la prospérité."
    }
  ]
}