{
  "flashcards": [
    {
      "statement": "Rivemont était une ville animée et bruyante.",
      "isTrue": false,
      "explanation": "Le texte décrit Rivemont comme une ville paisible où tout le monde se connaissait."
    },
    {
      "statement": "Les Beaumont étaient une famille riche et influente.",
      "isTrue": false,
      "explanation": "Le texte les décrit comme une famille modeste."
    },
    {
      "statement": "Jacques Beaumont était boulanger.",
      "isTrue": false,
      "explanation": "Jacques Beaumont était forgeron."
    },
    {
      "statement": "Louise et Antoine ont découvert un passage secret sous un vieux chêne.",
      "isTrue": true,
      "explanation": "Le texte décrit la découverte du passage secret sous les racines d'un vieux chêne."
    },
    {
      "statement": "Le coffre contenait uniquement des pièces d'or.",
      "isTrue": false,
      "explanation": "Le coffre contenait des pièces d'or, des bijoux anciens et des parchemins mystérieux."
    },
    {
      "statement": "Les parchemins parlaient d'un royaume perdu.",
      "isTrue": true,
      "explanation": "Jacques a reconnu des écritures parlant d'un royaume perdu autrefois prospère."
    },
    {
      "statement": "La famille Beaumont a trouvé des artefacts non magiques dans la grotte.",
      "isTrue": false,
      "explanation": "Ils ont découvert des artefacts magiques."
    },
    {
      "statement": "La terre a tremblé après la découverte des trésors.",
      "isTrue": true,
      "explanation": "Le texte mentionne un tremblement de terre et une voix caverneuse après l'ouverture des coffres."
    },
    {
      "statement": "La quête de la famille Beaumont consistait à trouver un animal mythique.",
      "isTrue": false,
      "explanation": "Leur quête consistait à trouver le roi disparu et restaurer l'équilibre du royaume."
    },
    {
      "statement": "Le roi était prisonnier dans une forteresse oubliée.",
      "isTrue": true,
      "explanation": "Le texte indique que le roi perdu était prisonnier dans une forteresse oubliée."
    },
    {
      "statement": "Après la libération du roi, Rivemont est restée pauvre.",
      "isTrue": false,
      "explanation": "Après la libération du roi, le trésor fut partagé et Rivemont vécut dans la prospérité."
    }
  ]
}