{
  "flashcards": [
    {
      "statement": "Le stage d'IYANDA Ismaël Emmanuel a duré un mois.",
      "isTrue": false,
      "explanation": "Le rapport indique que le stage a duré deux (02) mois."
    },
    {
      "statement": "Biovatech est spécialisée dans le développement d'applications web, mobiles, le design et les formations numériques.",
      "isTrue": true,
      "explanation": "Le texte le précise dans la section I. Présentation de la structure."
    },
    {
      "statement": "Le mini-projet 'Interface de Gestion CRUD d’Articles' utilisait React comme framework frontend.",
      "isTrue": false,
      "explanation": "Le mini-projet utilisait Bootstrap, HTML, CSS, JQUERY, AJAX et Firebase."
    },
    {
      "statement": "Le projet d'application web d'inscription aux ateliers utilisait Node.js en backend.",
      "isTrue": false,
      "explanation": "Le backend utilisait NestJS."
    },
    {
      "statement": "MongoDB était la base de données utilisée pour le projet d'inscription aux ateliers.",
      "isTrue": true,
      "explanation": "Ceci est spécifié dans la section II.B."
    },
    {
      "statement": "Le mini-projet sur les microservices portait sur la gestion d'une bibliothèque en ligne.",
      "isTrue": true,
      "explanation": "La description du mini-projet le confirme."
    },
    {
      "statement": "L'étape d'analyse des besoins des projets durait toujours plus de deux jours.",
      "isTrue": false,
      "explanation": "Le texte indique que cette étape durait généralement entre 1 et 2 jours."
    },
    {
      "statement": "IYANDA Ismaël Emmanuel a utilisé Insomnia pour tester les APIs.",
      "isTrue": true,
      "explanation": "Ceci est mentionné dans les sections II.B et II.C."
    },
    {
      "statement": "Les difficultés rencontrées concernaient uniquement le frontend.",
      "isTrue": false,
      "explanation": "Des difficultés ont été rencontrées aussi bien en backend (NestJS, implémentation de filtres et pagination) qu'en frontend (Angular, intégration des paiements)."
    },
    {
      "statement": "IYANDA Ismaël Emmanuel a acquis une maîtrise de Angular et de Tailwind CSS.",
      "isTrue": true,
      "explanation": "Ceci est explicitement mentionné dans la section V. Compétences développées."
    },
    {
      "statement": "Le stage a été jugé peu bénéfique par l'étudiant.",
      "isTrue": false,
      "explanation": "L'étudiant décrit son expérience comme 'très bénéfique' dans la section VI. Analyse personnelle."
    }
  ]
}